## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 5 to add, 19 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api will be created
  + resource "aws_api_gateway_deployment" "api" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = "zjyu1t6h7e"
      + stage_description = "f5a3f62cb3f6fd2f421fbe060e34a508"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.path.proxy" = "method.request.path.proxy"
        }
      + resource_id             = "5souaj"
      + rest_api_id             = "zjyu1t6h7e"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:lambda:ca-central-1:806545929748:function:api"
    }

  # aws_api_gateway_integration_response.integration_response will be created
  + resource "aws_api_gateway_integration_response" "integration_response" {
      + http_method        = "ANY"
      + id                 = (known after apply)
      + resource_id        = "5souaj"
      + response_templates = {
          + "application/json" = ""
        }
      + rest_api_id        = "zjyu1t6h7e"
      + status_code        = "200"
    }

  # aws_api_gateway_method_response.api_response_200 will be updated in-place
  ~ resource "aws_api_gateway_method_response" "api_response_200" {
        id                  = "agmr-zjyu1t6h7e-5souaj-ANY-200"
      ~ response_parameters = {
          + "method.response.header.Strict-Transport-Security" = true
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "zjyu1t6h7e"
      + stage_name  = "v1"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_rest_api.api will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "api" {
        id                           = "zjyu1t6h7e"
        name                         = "api-gateway"
      ~ tags                         = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all                     = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.api will be created
  + resource "aws_api_gateway_stage" "api" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "zjyu1t6h7e"
      + stage_name    = "v1"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/api-gateway/api-access"
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                }
            )
        }
    }

  # aws_cloudwatch_log_group.api_access will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_access" {
        id                = "/aws/api-gateway/api-access"
        name              = "/aws/api-gateway/api-access"
      ~ tags              = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all          = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_waf will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_waf" {
        id                = "/aws/kinesisfirehose/api_waf"
        name              = "/aws/kinesisfirehose/api_waf"
      ~ tags              = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all          = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_ecr_repository.api will be updated in-place
  ~ resource "aws_ecr_repository" "api" {
        id                   = "scan-files/api"
        name                 = "scan-files/api"
      ~ tags                 = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all             = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api"
        name      = "scan-files-api"
      ~ tags      = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all  = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.write_waf_logs will be updated in-place
  ~ resource "aws_iam_policy" "write_waf_logs" {
        id          = "arn:aws:iam::806545929748:policy/scan-files_WriteLogs"
        name        = "scan-files_WriteLogs"
      ~ tags        = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all    = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.api will be updated in-place
  ~ resource "aws_iam_role" "api" {
        id                    = "scan-files-api"
        name                  = "scan-files-api"
      ~ tags                  = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all              = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.api_cloudwatch will be updated in-place
  ~ resource "aws_iam_role" "api_cloudwatch" {
        id                    = "ApiGatewayCloudWatchRole"
        name                  = "ApiGatewayCloudWatchRole"
      ~ tags                  = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all              = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.waf_log_role will be updated in-place
  ~ resource "aws_iam_role" "waf_log_role" {
        id                    = "scan-files-logs"
        name                  = "scan-files-logs"
      ~ tags                  = {
          - "CostCentre" = "scan-files-production" -> null
          - "Terraform"  = "True" -> null
        }
      ~ tags_all              = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "True"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_kinesis_firehose_delivery_stream.api_waf will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "api_waf" {
        id             = "arn:aws:firehose:ca-central-1:806545929748:deliverystream/aws-waf-logs-scan-files"
        name           = "aws-waf-logs-scan-files"
      ~ tags           = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all       = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_kms_key.scan-files will be updated in-place
  ~ resource "aws_kms_key" "scan-files" {
        id                                 = "c71bf0dd-721d-4f36-be85-5bea7927ad43"
      ~ tags                               = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all                           = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_security_group.api will be updated in-place
  ~ resource "aws_security_group" "api" {
        id                     = "sg-0845d9714e0c52b00"
        name                   = "scan-files_api_sg"
      ~ tags                   = {
          - "CostCentre" = "scan-files-production" -> null
          - "Terraform"  = "True" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          - "CostCentre" = "scan-files-production" -> null
          - "Terraform"  = "True" -> null
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.api_waf will be updated in-place
  ~ resource "aws_wafv2_web_acl" "api_waf" {
        id          = "ca5274a3-f27b-4562-a21e-5cd0c8c17835"
        name        = "api_waf"
      ~ tags        = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
      ~ tags_all    = {
          + "CostCenter" = "scan-files-production"
          - "CostCentre" = "scan-files-production" -> null
          ~ "Terraform"  = "True" -> "true"
        }
        # (5 unchanged attributes hidden)



        # (8 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      + code_signing_config_arn        = ""
      + description                    = ""
      + handler                        = ""
        id                             = "api"
      + kms_key_arn                    = ""
      + runtime                        = ""
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

      + environment {
          + variables = {
              + "API_AUTH_TOKEN"          = (sensitive)
              + "SQLALCHEMY_DATABASE_URI" = (sensitive)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # module.vpc.data.aws_iam_policy_document.vpc_metrics_flow_logs_write[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write"  {
      ~ id      = "2102763991" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.vpc.aws_cloudwatch_log_group.flow_logs[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "flow_logs" {
        id                = "scan-files_flow_logs"
        name              = "scan-files_flow_logs"
      ~ tags              = {
          - "CostCentre" = "scan-files-production" -> null
          - "Terraform"  = "True" -> null
        }
      ~ tags_all          = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "True"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_flow_log.flow_logs[0] will be updated in-place
  ~ resource "aws_flow_log" "flow_logs" {
        id                       = "fl-0ed19996e32602de1"
      ~ tags                     = {
          - "CostCentre" = "scan-files-production" -> null
          - "Terraform"  = "True" -> null
        }
      ~ tags_all                 = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "True"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "vpc_metrics_flow_logs_write_policy" {
        id          = "arn:aws:iam::806545929748:policy/VpcMetricsFlowLogsWrite"
        name        = "VpcMetricsFlowLogsWrite"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags        = {
          - "CostCentre" = "scan-files-production" -> null
          - "Terraform"  = "True" -> null
        }
      ~ tags_all    = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "True"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_iam_role.flow_logs[0] will be updated in-place
  ~ resource "aws_iam_role" "flow_logs" {
        id                    = "scan-files_flow_logs"
        name                  = "scan-files_flow_logs"
      ~ tags                  = {
          - "CostCentre" = "scan-files-production" -> null
          - "Terraform"  = "True" -> null
        }
      ~ tags_all              = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "True"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 19 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.write_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.waf_log_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.scan-files"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_cloudwatch_log_group.flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_flow_log.flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_iam_role.flow_logs[0]"]

26 tests, 8 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
